# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# Gitからプールしない場合
# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# データセットをダウンロードする
!wget https://sagacentralstorage.blob.core.windows.net/dataset/potato-chips.zip

# zipファイルを解凍する
!unzip potato-chips.zip

# いらないファイルを削除する
!rm -r potato-chips.zip
# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# Gitからプールする場合
# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# レポシトリをクローンする
!git clone https://[username]:[passsword]@github.com/lee4205/Potato_Chip_Classification.git

# メールとユーザ名の設定
!git config --global user.email "[email@gmail.com]"
!git config --global user.name "[username]"

# ワークスペースに移動する
cd [Potato_Chip_Classificationのパス]

# 作業ブランチを作成する
!git branch [ブランチ名]

# 作業ブランチに切り替える
!git checkout [ブランチ名]
# ～～～～～～～～～～～～～～～～～～～～～～作業始める～～～～～～～～～～～～～～～～～～～～～～～

# ～～～～～～～～～～～～～～～～～～～～～～作業終わる～～～～～～～～～～～～～～～～～～～～～～～
# ファイルの変更を追加する
!git add [ファイル名]

# commitのメッセージを書く
!git commit -m "[commitのメッセージ]"

# ファイルの変更をgitにプッシュする
!git push origin [ブランチ名]
# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# Gitに関するコマンド
# ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
# masterブランチからプールする
!git pull origin master

# ファイルの変更のみ取り消し（add、commitは取り消せない）
!git checkout .

# commitの取り消し
!git reset --soft

# commitとaddの取り消し
!git reset --mixed

# commit、addとファイルの変更の取り消し
!git reset --hard

# 変更の状態を確認する
!git status

# ログを見る
!git log --all
